//4.1
function evenOdd (Number) {
    if (Number % 2 === 0) {
        return "เลขคู่"
    } else {
        return "เลขคี่"
    }
} 
console.log(evenOdd(8))
console.log(evenOdd(9))
/* สร้าง function ชื่อว่า evenOdd และเก็บค่าเป็น Number จากนั้นนำมาเช็คว่า ตัวแปร Number เป็นเลขคู่หรือคี่
    โดยใช้คำสั่ง if else ในการตรวจสอบ ถ้า จริง ให้แสดง... ถ้าไม่จริง ให้แสดง ....
    
    โดยใช้ Number % 2 โดย % คือเครื่องหมายที่ใช้ในการหาค่าเศษของการหาร
    โดยการเอา Number % 2 คือ การที่เอาตัวเลขที่ส่งเข้าไปใน Number ไป % 2 เช่น 10 % 2 = 0 เพราะ10%2 นั้นไม่มีเศษ
    แต่ถ้า 9 % 2 = 1 เนื่องจาก พอ % 2 แล้ว จะได้ 0.1 จะทำการเอาเศษมาตอบ จะได้ = 1 นั่นเอง
    
    ==== คือ เครื่องหมายเปรียบเทียบ ที่ใช้ตรวจสอบว่าค่าทั้ง 2 ข้าง เท่ากันไหม ถ้า % 2 แล้ว เท่ากับ 0 ก็จะเป็น เลขคู่ 
    แต่ถ้าไม่เท่ากับ 0 จะเป็นเลขคี่ครับ*/

//4.2
function calculateparking (Number) { //ตั้งชื่อฟังก์ชันว่า calculeteparking โดยมีการรับตัวแปร ชื่อว่า Number
    let hours = Math.ceil(Number / 60)  //ประกาศตัวแปรเป็น let ชื่อ hours ไว้เก็บค่าที่ส่งมา และใช้ Math.ceil ceil คือการปัดเศษขึ้น เช่น 90/60 เท่ากับ 1.5 ปัดเศษขึ้นเป็น 2
    let fee = 0; //ประกาศตัวแปรเพื่อไว้เก็บค่าจอดรถ โดยค่าจอดรถสามารถเปลี่ยนแปลงได้

    if (hours <= 1) { //เงื่อนไขแรก ถ้า ชั่วโมง น้อยกว่าหรือเท่ากับ 1 
        return "จอด "+ Number + " นาที " + " ฟรี" // จอดรถฟรี
    } else if (hours <= 2 ) { //เงื่อนไขสอง ถ้า ชั่วโมง น้อยกว่าเท่ากับ 2
        fee = 10; //ค่าจอดรถ จะเพิ่มขึ้น 10 บาท
        return "จอด "+  Number+ " นาที "+ " " + fee + "บาท" // เสียค่าจอดรถ 10 บาท
    } else if (hours >= 3 && hours <= 6 ) { //เงื่อนไขที่สาม ถ้า ชั่วโมง มากกว่าหรือเท่ากับ 3 และ น้อยกว่าหรือเท่ากับ 6
        fee = 10+ (hours - 2) * 20 ; /*ค่าจอดรถจะเพิ่มขึ้น 50 บาท โดยที่เอา ชม.ที่ได้ ไปลบ2 จากนั้น คูณ 20 และ + 10 
        ยกตัวอย่าง 190หาร 60 = 3.16 ปัดเศษขึ้นเป็น 4 จากนั้น นำ 4-2 = 2 และนำ 2 * 20 = 40 และนำ 40 + 10 = 50  */
        return "จอด "+ Number+ " นาที "+ " " + fee + "บาท" //เสียค่าจอดรถ 50 บาท
    } else { //เงื่อนไขสุดท้าย ถ้ามากกว่า 6 
    fee = 100; //ค่าจอดรถ 100 บาท
        return "จอด "+  Number+ " นาที "+ " " + fee + "บาท" // เสียค่าจอดรถ 100 บาท
    }
}

console.log(calculateparking(30))
console.log(calculateparking(90))
console.log(calculateparking(190))
console.log(calculateparking(400))