//5.1
function ArrayNumber (Number) { //ประกาศฟังก์ชันชื่อ ArrayNumber และ รับค่า Number เข้าไป
    let sum = 0; //ประกาศชนิดตัวแปรเป็น let ชื่อ sum เพื่อไว้เปลี่ยนค่าsum
    for (let i = 0; i < Number.length; i++) { /* for คือ การวนลูป let i = 0 ประกาศตัวแปร i ให้ = 0 
        i < Number.length คือ ตรวจสอบว่า i น้อยกว่าจำนวนสมาชิกใน Array หรือยัง
        i++ คือเพิ่มค่า i ทีละ 1 ถ้ายังน้อยกว่าสมาชิกใน Array ให้ทำการเพิ่ม 1 ไปเรื่อยๆ 
        เช่น i = 0 และ i < จำนวนสมาชิกในArray i = 1 เพิ่มไปเรื่อยๆจนกว่าจะ = 5 หรือ มากกว่าเท่ากับ 5 เพื่อหยุดการลูป  */
        sum += Number[i] /*คือการเพิ่มค่า Number[i] ไปยัง sum โดย [i] คือตำแหน่งแรกของ sum คือตำแหน่งที่ 0
        และตำแหน่งที่ 0 คือ 5 จากนั้น ก็เพิ่มค่า i ไปเรื่อยๆจนถึงตำแหน่งที่ 5 จากนั้นค่า sum+= Number ก็จะ =
        5 + 6 + 7 + 8 + 9 + 10 = 45*/ 
    }
    return sum / Number.length; // sum ที่ได้ทั้งหมด คือ 45 มาหาร จำนวนสมาชิกอาเรย์คือ 6
}

console.log(ArrayNumber([5, 6, 7, 8, 9, 10])) //จำนวนสมาชิกในอาเรย์นี้ มี 6

//5.2
function christmasTree(number) { //สร้างฟังก์ชันชื่อ christmasTree รับค่าเป็น Number
    for (let i = 1; i <= number; i++) { /*เข้าสู่ For Loop แรก ทำการวาดชั้นว่ามีกี่ชั้น ประกาศตัวแปร i ให้เป็น let เพื่อสามารถที่จะเปลี่ยนค่าได้
        i = 1 และ ถ้า iน้อยกว่าเท่ากับ number i++ ให้เพิ่มค่าไปเรื่อยๆ จนกว่าจะเท่ากับ number หรือค่าที่ส่งเข้ามา
        เช่น number = 3 i ก็จะเพิ่มค่าไปเรื่อยๆเป็น 1 2 3 ทั้งหมดก็มี 3 ชั้น*/
      let star = ''; //กำหนดตัวแปร ชื่อ star เป็น string เก็บ ค่าว่าง
      for (let j = 1; j <= i; j++) { /* ทำการLoop ที่ 2 คือ การเพิ่มโครงสร้างเข้าไป ตัวแปร j เปรียบเสมือนจำนวนดาวที่ใส่เข้าไปในแต่ละชั้น
        และ jน้อยกว่าเท่ากับ i คือ ถ้า ลูปแรก i มีค่าเท่ากับเท่าไหร่ j ก็จะมีค่าเท่ากับ i เช่น i ชั้นแรก เท่ากับ1 j ก็จะมีจำนวนดาวในชั้น i = 1 */
        star += '*'; //ทำการเปลี่ยนค่าว่างของ star ให้เป็น * เพราะสวยดี และนำ * เพิ่มเข้าไปใน j ก็จะกลายเป็น
        //ถ้า i = 1 2 3 ทั้งหมด 3 ชั้น j ก็ = * ** *** มี * ตามจำนวนชั้น
      }
      console.log(star); //ทำการแสดงผลลัพธ์ แค่ star ออกมา
    }
  }
  
christmasTree(5); // การเรียกฟังก์ชันและใส่ค่าเข้าไปแบบนี้ คือจะไม่มีการ Returnค่ากลับมา
//แต่ถ้า console.log จะมีการReturnค่ากลับมาที่console